cf_billing/InformationRegisters/энргНастройкиСниженияСтоимостиУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкиСниженияСтоимостиУслуг</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентСнижения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкиСниженияСтоимостиУслуг/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерефейса_ЗаполнениеСхемыЗапроса

Процедура НастройкиСниженияСтоимостиУслуг(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкиСниженияСтоимостиУслуг());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
		
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 				= "Организация, Район, Услуга";
		ПараметрыВиртуальнойТаблицы = ОператорВыбора.Источники[0].Источник.Параметры[1];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрыВиртуальнойТаблицы, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
		
КонецПроцедуры

Процедура НастройкиСниженияСтоимостиУслугКоллекцияПериодов(Схема, ПараметрыОтбора, ТаблицаПериодов, ТаблицаДляПомещения = "") Экспорт 
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкиСниженияСтоимостиУслугКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	//ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	//Источник 						= ОператорВыбора.Источники[1].Источник;		
КонецПроцедуры

#Область ТекстыЗапросов

Функция ТекстЗапросаНастройкиСниженияСтоимостиУслуг() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	энргНастройкиСниженияСтоимостиУслуг.Организация КАК Организация,
	|	энргНастройкиСниженияСтоимостиУслуг.Район КАК Район,
	|	энргНастройкиСниженияСтоимостиУслуг.Услуга КАК Услуга,
	|	энргНастройкиСниженияСтоимостиУслуг.ПроцентСнижения КАК ПроцентСнижения
	|ИЗ
	|	РегистрСведений.энргНастройкиСниженияСтоимостиУслуг.СрезПоследних КАК энргНастройкиСниженияСтоимостиУслуг";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаНастройкиСниженияСтоимостиУслугКоллекцияПериодов()
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаНастроек.Организация КАК Организация,
	|	ТаблицаНастроек.Район КАК Район,
	|	ТаблицаНастроек.Услуга КАК Услуга,
	|	ТаблицаНастроек.ПроцентСнижения КАК ПроцентСнижения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		ТаблицаНастроек.Организация КАК Организация,
	|		ТаблицаНастроек.Район КАК Район,
	|		ТаблицаНастроек.Услуга КАК Услуга,
	|		МАКСИМУМ(ТаблицаНастроек.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энргНастройкиСниженияСтоимостиУслуг КАК ТаблицаНастроек
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО (ТаблицаПериодов.Организация = ТаблицаПериодов.Организация)
	|				И (ТаблицаПериодов.Район = ТаблицаПериодов.Район)
	|				И ТаблицаНастроек.Период < ТаблицаПериодов.ЗавершениеОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		ТаблицаНастроек.Организация,
	|		ТаблицаНастроек.Район,
	|		ТаблицаНастроек.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкиСниженияСтоимостиУслуг КАК ТаблицаНастроек
	|		ПО ВложенныйЗапрос.Период = ТаблицаНастроек.Период
	|			И ВложенныйЗапрос.Организация = ТаблицаНастроек.Организация
	|			И ВложенныйЗапрос.Район = ТаблицаНастроек.Район
	|			И ВложенныйЗапрос.Услуга = ТаблицаНастроек.Услуга";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
